Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_semc_sdram.c
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_00_SEMC_DATA00,         /* GPIO_EMC_00 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_01_SEMC_DATA01,         /* GPIO_EMC_01 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_02_SEMC_DATA02,         /* GPIO_EMC_02 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_03_SEMC_DATA03,         /* GPIO_EMC_03 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_04_SEMC_DATA04,         /* GPIO_EMC_04 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_05_SEMC_DATA05,         /* GPIO_EMC_05 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_06_SEMC_DATA06,         /* GPIO_EMC_06 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_07_SEMC_DATA07,         /* GPIO_EMC_07 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_08_SEMC_DM00,           /* GPIO_EMC_08 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_09_SEMC_ADDR00,         /* GPIO_EMC_09 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_10_SEMC_ADDR01,         /* GPIO_EMC_10 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_11_SEMC_ADDR02,         /* GPIO_EMC_11 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_12_SEMC_ADDR03,         /* GPIO_EMC_12 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_13_SEMC_ADDR04,         /* GPIO_EMC_13 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_14_SEMC_ADDR05,         /* GPIO_EMC_14 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_15_SEMC_ADDR06,         /* GPIO_EMC_15 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_16_SEMC_ADDR07,         /* GPIO_EMC_16 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_17_SEMC_ADDR08,         /* GPIO_EMC_17 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_18_SEMC_ADDR09,         /* GPIO_EMC_18 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_19_SEMC_ADDR11,         /* GPIO_EMC_19 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_20_SEMC_ADDR12,         /* GPIO_EMC_20 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_21_SEMC_BA0,            /* GPIO_EMC_21 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_22_SEMC_BA1,            /* GPIO_EMC_22 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_23_SEMC_ADDR10,         /* GPIO_EMC_23 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_24_SEMC_CAS,            /* GPIO_EMC_24 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_25_SEMC_RAS,            /* GPIO_EMC_25 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_26_SEMC_CLK,            /* GPIO_EMC_26 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_27_SEMC_CKE,            /* GPIO_EMC_27 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_28_SEMC_WE,             /* GPIO_EMC_28 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_29_SEMC_CS0,            /* GPIO_EMC_29 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_30_SEMC_DATA08,         /* GPIO_EMC_30 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_31_SEMC_DATA09,         /* GPIO_EMC_31 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_32_SEMC_DATA10,         /* GPIO_EMC_32 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_33_SEMC_DATA11,         /* GPIO_EMC_33 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_34_SEMC_DATA12,         /* GPIO_EMC_34 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_35_SEMC_DATA13,         /* GPIO_EMC_35 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_36_SEMC_DATA14,         /* GPIO_EMC_36 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_37_SEMC_DATA15,         /* GPIO_EMC_37 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_38_SEMC_DM01,           /* GPIO_EMC_38 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_39_SEMC_DQS,            /* GPIO_EMC_39 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_40_SEMC_RDY,            /* GPIO_EMC_40 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_EMC_41_SEMC_CSX00,          /* GPIO_EMC_41 PAD functional properties : */
		0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/7
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	#endif
}

/************************************************************************************
 * Name: imxrt_semc_sdram_clock_init
 *
 * Description:
 *   Initialize clock setting in semc for sdram
 *
 ************************************************************************************/
static inline void imxrt_semc_sdram_clock_init(void)
{
	imxrt_clock_initsyspfd(kCLOCK_Pfd2, 29);
    /* Set semc clock to 163.86 MHz */
    imxrt_clock_setmux(kCLOCK_SemcMux, 1);
    imxrt_clock_setdiv(kCLOCK_SemcDiv, 1); 
}

