Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_semc_sdram.c
/************************************************************************************
 * Public Functions
 ************************************************************************************/
/****************************************************************************
 * Public Types
 ****************************************************************************/

/************************************************************************************
 * Name: imxrt_semc_sdram_init
 *
 * Description:
 *   Initialize sdram 
 *
 ************************************************************************************/
void imxrt_semc_sdram_init(void)
{
	semc_config_t config;
    semc_sdram_config_t sdramconfig;
    uint32_t clockFrq;
	char tempLog[128];

	imxrt_semc_sdram_pins_init();
	imxrt_semc_sdram_clock_init();

	imxrt_clock_enableclock(kCLOCK_Semc);

	clockFrq = imxrt_clock_getfreq(kCLOCK_SemcClk);
	snprintf(tempLog, sizeof(tempLog), "first clockFrq => %d", clockFrq);
	IMXLOG(tempLog);

    /* Initializes the MAC configure structure to zero. */
    memset(&config, 0, sizeof(semc_config_t));
    memset(&sdramconfig, 0, sizeof(semc_sdram_config_t));

    /* Initialize SEMC. */
    imxrt_semc_getdefaultconfig(&config);
    config.dqsMode = kSEMC_Loopbackdqspad;  /* For more accurate timing. */
    imxrt_semc_init(SEMC, &config);

	clockFrq = imxrt_clock_getfreq(kCLOCK_SemcClk);
	snprintf(tempLog, sizeof(tempLog), "second clockFrq => %d", clockFrq);
	IMXLOG(tempLog);

    /* Configure SDRAM. */
    sdramconfig.csxPinMux = kSEMC_MUXCSX0;
    sdramconfig.address = 0x80000000;
    sdramconfig.memsize_kbytes = 32 * 1024; /* 32MB = 32*1024*1KBytes*/
    sdramconfig.portSize = kSEMC_PortSize16Bit;
    sdramconfig.burstLen = kSEMC_Sdram_BurstLen8;
    sdramconfig.columnAddrBitNum = kSEMC_SdramColunm_9bit;
    sdramconfig.casLatency = kSEMC_LatencyThree;
    sdramconfig.tPrecharge2Act_Ns = 18;   /* Trp 18ns */
    sdramconfig.tAct2ReadWrite_Ns = 18;   /* Trcd 18ns */
    sdramconfig.tRefreshRecovery_Ns = 67; /* Use the maximum of the (Trfc , Txsr). */
    sdramconfig.tWriteRecovery_Ns = 12;   /* 12ns */
    sdramconfig.tCkeOff_Ns = 42;  /* The minimum cycle of SDRAM CLK off state. CKE is off in self refresh at a minimum period tRAS.*/
    sdramconfig.tAct2Prechage_Ns = 42; /* Tras 42ns */
    sdramconfig.tSelfRefRecovery_Ns = 67;
    sdramconfig.tRefresh2Refresh_Ns = 60;
    sdramconfig.tAct2Act_Ns = 60;
    sdramconfig.tPrescalePeriod_Ns = 160 * (1000000000 / clockFrq);
    sdramconfig.refreshPeriod_nsPerRow = 64 * 1000000 / 8192; /* 64ms/8192 */
    sdramconfig.refreshUrgThreshold = sdramconfig.refreshPeriod_nsPerRow;
    sdramconfig.refreshBurstLen = 1;
    imxrt_semc_configuresdram(SEMC, kSEMC_SDRAM_CS0, &sdramconfig, clockFrq);
}

